#define _CRT_SECURE_NO_DEPRECATE
#include<stdio.h>
int main() {
	int day[12] = { 31,0,31,30,31,30,31,31,30,31,30,31 };	//每个月份各有多少天。由于2月不确定，所以暂且设为0
	int year, month, date;
	int total = 0;		//天数

	while (scanf("%d/%d/%d", &year, &month, &date) != EOF) {
		if ((year % 400 == 0) || ((year % 100 != 0) && (year % 4 == 0))) {		//判断输入年份是否是闰年,然后设置二月天数
			day[1] = 29;
		}
		else {
			day[1] = 28;
		}

		int i = 0;		//月份计数
		while (i < month - 1) {
			total += day[i];
			i++;
		}

		total += date;
		printf("%d\n", total);
		total = 0;
	}
	return 0;
}

// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单

// 入门使用技巧: 
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件
